; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   empty - empty_0
   blue_door_1 - door
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (seen_psi_1))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))) (or (not (= ?door blue_door_1)) (seen_psi_1)))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (when (= ?door blue_door_1) (hold_0)) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (seen_psi_1) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   blue_door_2 yellow_door_1 purple_door_1 - door
   grey_box_1 purple_box_1 purple_box_2 - box
   yellow_ball_1 green_ball_1 red_ball_2 red_ball_1 grey_ball_1 - ball
 )
 (:init (agentinroom room_1) (objectinroom grey_box_1 room_2) (objectinroom purple_box_1 room_2) (objectinroom grey_ball_1 room_2) (objectinroom red_ball_1 room_2) (objectinroom yellow_ball_1 room_2) (objectinroom red_ball_2 room_4) (objectinroom purple_box_2 room_4) (objectinroom green_ball_1 room_4) (objectcolor grey_box_1 greytype) (objectcolor purple_box_1 purpletype) (objectcolor grey_ball_1 greytype) (objectcolor red_ball_1 redtype) (objectcolor yellow_ball_1 yellowtype) (objectcolor red_ball_2 redtype) (objectcolor purple_box_2 purpletype) (objectcolor green_ball_1 greentype) (objectcolor blue_door_1 bluetype) (objectcolor blue_door_2 bluetype) (objectcolor yellow_door_1 yellowtype) (objectcolor purple_door_1 purpletype) (emptyhands) (locked blue_door_1) (locked blue_door_2) (locked yellow_door_1) (locked purple_door_1) (adjacentrooms room_2 room_1 blue_door_1) (adjacentrooms room_1 room_2 blue_door_1) (adjacentrooms room_3 room_1 blue_door_2) (adjacentrooms room_1 room_3 blue_door_2) (adjacentrooms room_4 room_2 yellow_door_1) (adjacentrooms room_2 room_4 yellow_door_1) (adjacentrooms room_4 room_3 purple_door_1) (adjacentrooms room_3 room_4 purple_door_1) (visited room_1) (= (total-cost) 0))
 (:goal (and (exists (?d - door)
 (and (objectcolor ?d yellowtype) (adjacentrooms room_4 room_2 ?d) (at_ ?d) (not (locked ?d)))) (hold_0)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor blue_door_2 room_1 room_3)
   added: (at_ blue_door_2)
   goals met: 0 of 2
2. (toggle blue_door_2)
   deleted: (locked blue_door_2)
   goals met: 0 of 2
3. (gotoroom room_1 room_3 blue_door_2)
   deleted: (agentinroom room_1) (at_ blue_door_2)
   added: (agentinroom room_3) (visited room_3)
   goals met: 0 of 2
4. (gotodoor purple_door_1 room_3 room_4)
   added: (at_ purple_door_1)
   goals met: 0 of 2
5. (toggle purple_door_1)
   deleted: (locked purple_door_1)
   goals met: 0 of 2
6. (gotoroom room_3 room_4 purple_door_1)
   deleted: (agentinroom room_3) (at_ purple_door_1)
   added: (agentinroom room_4) (visited room_4)
   goals met: 0 of 2
7. (gotodoor yellow_door_1 room_4 room_2)
   added: (at_ yellow_door_1)
   goals met: 0 of 2
8. (toggle yellow_door_1)
   deleted: (locked yellow_door_1)
   goals met: 1 of 2
9. (gotoobject green_ball_1 room_4)
   deleted: (at_ yellow_door_1)
   added: (at_ green_ball_1)
   goals met: 0 of 2
10. (pick green_ball_1 room_4)
   deleted: (at_ green_ball_1) (emptyhands) (objectinroom green_ball_1 room_4)
   added: (carrying green_ball_1) (seen_psi_1)
   goals met: 0 of 2
11. (gotoroom room_4 room_2 yellow_door_1)
   deleted: (agentinroom room_4)
   added: (agentinroom room_2) (visited room_2)
   goals met: 0 of 2
12. (gotodoor blue_door_1 room_2 room_1)
   added: (at_ blue_door_1) (hold_0)
   goals met: 1 of 2
13. (gotodoor yellow_door_1 room_2 room_4)
   deleted: (at_ blue_door_1)
   added: (at_ yellow_door_1)
   goals met: 2 of 2
